List<Map<String, dynamic>> questions = [
  {
    "category": "الانبياء",
    "levels": [
      [
        {
          "question": "ما هو عاصمة مصر؟",
          "options": ["القاهرة", "الإسكندرية", "أسوان", "الأقصر"],
          "correctAnswer": 0,
        },
        {
          "question": "ما هو أكبر كوكب في المجموعة الشمسية؟",
          "options": ["الأرض", "المريخ", "المشتري", "الزهرة"],
          "correctAnswer": 1,
        },
        {
          "question": "ما هو أكبر كوكب في المجموعة الشمسية؟",
          "options": ["الأرض", "المريخ", "المشتري", "الزهرة"],
          "correctAnswer": 2,
        },
        {
          "question": "ما هو عاصمة مصر؟",
          "options": ["القاهرة", "الإسكندرية", "أسوان", "الأقصر"],
          "correctAnswer": 0,
        },
        {
          "question": "ما هو أكبر كوكب في المجموعة الشمسية؟",
          "options": ["الأرض", "المريخ", "المشتري", "الزهرة"],
          "correctAnswer": 1,
        },
        {
          "question": "ما هو أكبر كوكب في المجموعة الشمسية؟",
          "options": ["الأرض", "المريخ", "المشتري", "الزهرة"],
          "correctAnswer": 2,
        },
        {
          "question": "ما هو عاصمة مصر؟",
          "options": ["القاهرة", "الإسكندرية", "أسوان", "الأقصر"],
          "correctAnswer": 0,
        },
        {
          "question": "ما هو أكبر كوكب في المجموعة الشمسية؟",
          "options": ["الأرض", "المريخ", "المشتري", "الزهرة"],
          "correctAnswer": 1,
        },
        {
          "question": "ما هو أكبر كوكب في المجموعة الشمسية؟",
          "options": ["الأرض", "المريخ", "المشتري", "الزهرة"],
          "correctAnswer": 2,
        },
        {
          "question": "ما هو أكبر كوكب في المجموعة الشمسية؟",
          "options": ["الأرض", "المريخ", "المشتري", "الزهرة"],
          "correctAnswer": 2,
        },
      ],
      [
        {
          "question": "ما هو عاصمة اليمن",
          "options": ["اب", "صنعاء", "عدن", "تعز"],
          "correctAnswer": 2,
        },
        {
          "question": "ما هو أكبر شهر في  السنه؟",
          "options": ["ابريل", "مارس", "يناير", "فبرير"],
          "correctAnswer": 2,
        },
      ]
    ]
  },
  {
    "category": "القران الكريم",
    "levels": [
      [
        {
          "question": "ما هو عاصمة ",
          "options": ["القاهرة", "الإسكندرية", "أسوان", "الأقصر"],
          "correctAnswer": 0,
        },
        {
          "question": "ما هو أكبر كوكب في المجموعة الشمسية؟",
          "options": ["الأرض", "المريخ", "المشتري", "الزهرة"],
          "correctAnswer": 2,
        },
      ],
      [
        {
          "question": "ما هو  اليمن",
          "options": ["اب", "صنعاء", "عدن", "تعز"],
          "correctAnswer": 2,
        },
        {
          "question": "ما هو   في  السنه؟",
          "options": ["ابريل", "مارس", "يناير", "فبرير"],
          "correctAnswer": 2,
        },
      ],
      [
        {
          "question": "ما هو عاصمة اليمن",
          "options": ["اب", "صنعاء", "عدن", "تعز"],
          "correctAnswer": 2,
        },
        {
          "question": "ما هو أكبر شهر في  السنه؟",
          "options": ["ابريل", "مارس", "يناير", "فبرير"],
          "correctAnswer": 2,
        },
      ],
    ]
  },
];
